{"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "model_10", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "input_12"}, "registered_name": null, "name": "input_12", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "TextVectorization", "config": {"name": "text_vectorization", "trainable": true, "dtype": "string", "batch_input_shape": [null], "max_tokens": 10000, "standardize": "lower_and_strip_punctuation", "split": "whitespace", "ngrams": null, "output_mode": "int", "output_sequence_length": 35, "pad_to_max_tokens": false, "sparse": false, "ragged": false, "vocabulary": null, "idf_weights": null, "encoding": "utf-8", "vocabulary_size": 1183}, "registered_name": null, "build_config": {"input_shape": [null]}, "name": "text_vectorization", "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "embedding_11", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 1182, "output_dim": 768, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, 35]}, "name": "embedding_11", "inbound_nodes": [[["text_vectorization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 768]}, "name": "dropout_11", "inbound_nodes": [[["embedding_11", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_34", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null, "shared_object_id": 139841527109120}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null, "shared_object_id": 139841527117712}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null, "shared_object_id": 139841527105952}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null, "build_config": {"input_shape": [null, 35, 768]}, "name": "lstm_34", "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Attention", "config": {"name": "attention_26", "trainable": true, "dtype": "float32", "dropout": 0.0, "use_scale": true, "score_mode": "dot"}, "registered_name": null, "build_config": {"input_shape": [[null, 35, 256], [null, 256]]}, "name": "attention_26", "inbound_nodes": [[["lstm_34", 0, 0, {}], ["lstm_34", 0, 1, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_26", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 35, 256], [null, 35, 256]]}, "name": "add_26", "inbound_nodes": [[["attention_26", 0, 0, {}], ["lstm_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_26", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 35, 256]}, "name": "layer_normalization_26", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_35", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null, "shared_object_id": 139841527106336}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null, "shared_object_id": 139841527119344}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null, "shared_object_id": 139841527113152}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null, "build_config": {"input_shape": [null, 35, 256]}, "name": "lstm_35", "inbound_nodes": [[["layer_normalization_26", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 1182, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "dense_19", "inbound_nodes": [[["lstm_35", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["dense_19", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": [null, 1]}, "compile_config": {"optimizer": "adam", "loss": "categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "weighted_metrics": null, "run_eagerly": null, "steps_per_execution": null, "jit_compile": null}}